<HTML>
<TITLE> Лобанова Диана Владимировна </TITLE>
<BODY>
<p> СР№2 Лобанова Диана Владимировна Вариант 3
</p>
<?php
$i = rand(1, 100);
print "i = $i <br>";
$sn = $i;
$b = 0;
for ($a = 1; $a <= $i; $a++) {
    if ($i % $a == 0) {
        $b = $b + $a;
    }
}
if ($b - $sn - 1 == 0) {
    echo " Характер  $i равен 0 <br>";
} else {
    print (($b - $sn - 1) . ' - Характер натурального числа ' . '<br>');
}
?>
<p> СР№2 Лобанова Диана Владимировна Вариант 7
<p>
    <?php
    $n = rand(1, 500);
    print "n = $n <br>";
    $S = 0;
    for ($x = 1; $x * $x < $n; $x++) {
        for ($y = $x; $y * $y < $n; $y++) {
            for ($z = $y; $z * $z < $n; $z++) {
                if ($x * $x + $y * $y + $z * $z == $n) {
                    print("$x * $x + $y * $y + $z * $z = $n <br>");
                    $S = 1;
                }
            }
        }
    }
    if ($S == 0) print("Невозможно представить");
    ?>
    </TABLE>
</BODY>
</HTML>